driver-tests/jmsbc/JMSBCTests/JMSBCjavaeeSETestJbi/test/JMSBCjavaeeSETestXAInOnly_Invoke/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:jms="http://xml.netbeans.org/schema/JMSBCjavaeeXAInOnlyTest">
  <soapenv:Body>
    <jms:message>
      <jms:msg>Hello JavaEE SE! This message is coming to you from JMS BC in XA!</jms:msg>
      <jms:corrId>123456</jms:corrId>
    </jms:message>
  </soapenv:Body>
</soapenv:Envelope>