driver-tests/jmsbc/JMSBCTests/JMSBCjavaeeSETestJbi/test/JMSBCjavaeeSETestXAInOnly_Invoke/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <message xmlns="http://xml.netbeans.org/schema/JMSBCjavaeeXAInOnlyTest">
      <ns0:msg xmlns:ns0="http://xml.netbeans.org/schema/JMSBCjavaeeXAInOnlyTest">Hello JavaEE SE! This message is coming to you from JMS BC in XA!</ns0:msg>
      <ns0:corrId xmlns:ns0="http://xml.netbeans.org/schema/JMSBCjavaeeXAInOnlyTest">123456</ns0:corrId>
    </message>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
